tykhaytschaar/midictrl/sdkconfig.defaults
# Target and flash
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# Custom partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Slightly larger main task stack for the bring-up phase
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
